
#Область ПрограммныйИнтерфейс

// ВКМ отправка уведомлений в телеграм.
Процедура ВКМ_ОтправкаУведомленийВТелеграм() Экспорт
	ОтправитьСообщение();
КонецПроцедуры

// Отправить сообщение.
Процедура ОтправитьСообщение() Экспорт

	ТокенТелеграм = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппыТелеграмм = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;

	Ресурс = "bot" + ТокенТелеграм + "/sendMessage";
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);

	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
	|ГДЕ
	|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Уведомление = Новый Структура;
		Уведомление.Вставить("chat_id", ИдентификаторГруппыТелеграмм);
		Уведомление.Вставить("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		ТелоОтвета = ЗаписатьЗначениеJSON(Уведомление);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоОтвета);

		Ответ = Соединение.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния = 200 Тогда
			УведомлениеДляОтправки = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			УведомлениеДляОтправки.Удалить();
		Иначе
			ОписаниеОшибки = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти	




