#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		ТекстСообщения = Неопределено;
		// Создание новой заявки на обслуживание
		Если ЭтоНовый() Тогда
			
			ЭтотОбъект.УстановитьНовыйНомер();
			
			ТекстСообщения = СтрШаблон("Оформлен новый заказ № %1, для клиента %2, начать работы %3 в %4, специалист %5",
			Номер, Контрагент, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"), Формат(ВремяНачалаРаботПлан, "ДЛФ=T"),
			Специалист);
			
		Иначе
			// Документ уже существует, получаем старые данные из базы
			СтарыйДокумент = Ссылка.ПолучитьОбъект();
			
			// Сравниваем ключевые реквизиты (дата/время и специалист)
			Если СтарыйДокумент.ДатаПроведенияРабот <> ДатаПроведенияРабот Или СтарыйДокумент.ВремяНачалаРаботПлан <> ВремяНачалаРаботПлан
				Или СтарыйДокумент.Специалист <> Специалист Тогда
				
				ТекстСообщения = СтрШаблон("Изменения заказа № %1, для клиента %2, начать работы %3 в %4, специалист %5",
				Номер, Контрагент, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"), Формат(ВремяНачалаРаботПлан, "ДЛФ=T"),
				Специалист);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			
			СправочникСообщенийДляТелеграмма = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			СправочникСообщенийДляТелеграмма.ТекстСообщения = ТекстСообщения;
			СправочникСообщенийДляТелеграмма.Записать();
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ,Режим)
		
		Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			
			Текст = СтрШаблон("Выбирите договор с абонентской платой, %1", Договор);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Дата < Договор.ВКМ_ДатаНачалаДоговора Или Дата > Договор.ВКМ_ДатаОкончанияДоговора Тогда
			
			Текст = "Ошибка: Дата документа не входит в период действия договора!";
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Контрагент КАК Контрагент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК Часы,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0) КАК СтоимостьЧаса
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО (ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка)
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Контрагент,
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Клиент = Выборка.Контрагент;
			Движение.Договор = Выборка.Договор;
			Движение.КоличествоЧасов = Выборка.Часы;
			Движение.СуммаКОплате = Выборка.Часы * Выборка.СтоимостьЧаса;
		КонецЦикла;
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы  
		
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина; 
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудникамСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ВКМ_УсловияОплатыСотрудникамСрезПоследних.ПроцентОтРабот ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВКМ_УсловияОплатыСотрудникамСрезПоследних.ПроцентОтРабот
		|	КОНЕЦ КАК Процент,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0) КАК Часы,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0) КАК СуммаКлиенту,
		|	ВКМ_УсловияОплатыСотрудникамСрезПоследних.ПроцентНазначен КАК ПроцентНазначен
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудникам.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудникамСрезПоследних
		|			ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудникамСрезПоследних.Сотрудник
		|		ПО ВКМ_ВыполненныеКлиентуРаботы.Регистратор = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ПроцентНазначен = Ложь Тогда
				
				Текст = СтрШаблон("Сотруднику %1 не установлен процент за выполненные работы", Специалист);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
			
			Если ВыборкаДетальныеЗаписи.Процент > 0 Тогда
				
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();	
				Движение.Период = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.Часы;
				Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаКлиенту * ВыборкаДетальныеЗаписи.Процент/100;
			КонецЕсли;
		КонецЦикла;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти
#КонецЕсли

