#Область ПрограммныйИнтерфейс

// Выводит реквизиты в форме.
// Для вызова из обработчика формы ПриИзменениеНаСервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить реквизиты.
//

// Добавить реквизиты.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить реквизиты.
Процедура ДобавитьРеквизиты(Форма) Экспорт
   
	ДобавитьПолеВСправочник(Форма);
	
КонецПроцедуры


// Дополнить форму.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команду.
Процедура ДополнитьФорму(Форма) Экспорт
    
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуВГруппаКоманднаяПанель(форма);	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура  ДобавитьПолеВСправочник(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить ("ДатаНачалаДоговора", Тип("Полеформы"), ); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора";
	
    ПолеВвода = Форма.Элементы.Добавить ("ДатаОкончанияДоговора", Тип("Полеформы"), ); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора";
	
    ПолеВвода = Форма.Элементы.Добавить ("АбонентскаяПлата", Тип("Полеформы"), ); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	ПолеВвода = Форма.Элементы.Добавить ("СтоимостьЧасаРаботыСпециалиста", Тип("Полеформы"), ); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	
КонецПроцедуры 

Процедура ДобавитьКнопкуВГруппаКоманднаяПанель(Форма)
	
	Команда = Форма.Команды.Добавить("ВКМ_Заполнить");
	Команда.Действие = "ВКМ_Заполнить";
	Команда.Заголовок = "Заполнить";
	Кнопка = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	Кнопка.ИмяКоманды = "ВКМ_Заполнить";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры

#КонецОбласти