#Область ПрограммныйИнтерфейс 

// Выполнить создание реализаций.
// 
// Параметры:
//  Период - Дата - период выбранный на форме
// 
// Возвращаемое значение:
//  Неопределено, Массив - Массив из Структуры
//     * Договор - Справочник.ВидДоговоров - договор по которому создается документ
//     * Ссылка - ДокументСсылка.РеализацияТоваровУслуг 
//     * Строка - Сторка со значением "новый"
Функция ВыполнитьСозданиеРеализаций(Период) Экспорт 
	
	НачалоПериода = Период.ДатаНачала; 
	КонецПериода = Период.ДатаОкончания; 
	ДокументыРеализации = Новый Массив;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора КАК ДатаНачалаДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("КонецМесяца", КонецПериода);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДокументыРеализации = Неопределено;
	КонецЕсли; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДатаНачалаДоговора > НачалоПериода Или ВыборкаДетальныеЗаписи.ДатаОкончанияДоговора < НачалоДня(КонецПериода) Тогда
			Продолжить;
		Иначе
			НовыйДокумент = Новый Структура;
			НовыйДокумент.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
			НовыйДокумент.Вставить("Ссылка", ВКМ_МассовоеСозданиеРеализаций.ВыполнитьАвтозаполнение(КонецПериода, ВыборкаДетальныеЗаписи.Договор,
			ВыборкаДетальныеЗаписи.Контрагент)); 
			НовыйДокумент.Вставить("Статус","Новый");
			ДокументыРеализации.Добавить(НовыйДокумент);
		КонецЕсли;	
	КонецЦикла; 
		
	Возврат ДокументыРеализации;
КонецФункции 

// Функция создание документов "реализация товаров услуг" за указанный период
// Параметры:
//  КонецПериода - Дата - дата создания документов реализации из обработки "Массовое создание актов" 
//  Договор - СправочникСсылка.ДоговорыКонтрагентов - договор с контрагентом по которому создается документ Реализация товаров услуг
//  Контрагент - СправочникСсылка.Контрагенты - контрагент для которого создается документ реализации товаров услуг 
// Возвращаемое значение:	
//   ДокументСсылка - ДокументСсылка.РеализацияТоваровУслуг - ссылка на созданный Документ Реализации товаров услуг
Функция  ВыполнитьАвтозаполнение (КонецПериода, Договор, Контрагент) Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовПриход, 0) КАК Часы,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеПриход, 0) КАК Сумма,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.Организация КАК Организация,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_АбонентскаяПлата, 0) КАК АбонентскаяПлата,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_СтоимостьЧасаРаботыСпециалиста, 0) КАК ЦенаЧаса
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Клиент = &Контрагент
	|				И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата, 0) КАК АбонентскаяПлата,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
		Запрос.УстановитьПараметр("Договор", Договор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.АбонентскаяПлата = 0  Тогда
				Продолжить;
			Иначе	
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = КонецПериода;
				Реализация.Договор = Договор;
				Реализация.Организация = ВыборкаДетальныеЗаписи.Организация;
				Реализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				Реализация.Ответственный = Пользователи.ТекущийПользователь();
				НоваяСтрока = Реализация.Услуги.Добавить();
				НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.АбонентскаяПлата;
				НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.АбонентскаяПлата; 
				Реализация.СуммаДокумента = Реализация.Услуги.Итог("Сумма");
			КонецЕсли; 
		КонецЦикла;
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.АбонентскаяПлата = 0 Тогда
				Продолжить;
			Иначе	
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = КонецПериода;
				Реализация.Договор = Выборка.Договор;
				Реализация.Организация = Выборка.Организация;
				Реализация.Контрагент = Выборка.Клиент;
				Реализация.Ответственный = Пользователи.ТекущийПользователь();
				НоваяСтрока = Реализация.Услуги.Добавить();
				НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Цена = Выборка.АбонентскаяПлата;
				НоваяСтрока.Сумма = Выборка.АбонентскаяПлата;
			КонецЕсли;  
			Если Выборка.Сумма = 0 Тогда
				Продолжить;
			Иначе
				НоваяСтрока = Реализация.Услуги.Добавить();
				
				НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
				НоваяСтрока.Количество = Выборка.Часы;
				НоваяСтрока.Цена = Выборка.ЦенаЧаса;
				НоваяСтрока.Сумма = Выборка.Сумма;		
			КонецЕсли; 
			Реализация.СуммаДокумента = Реализация.Услуги.Итог("Сумма");
			
		КонецЦикла; 
	КонецЕсли; 
	Если Не Реализация.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат Неопределено; 
	КонецЕсли;
	
	Реализация.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Реализация.Ссылка;
КонецФункции

#КонецОбласти
