#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РассчитатьСуммарнуюДлительностьОтпусков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	РассчитатьСуммарнуюДлительностьОтпусков();
КонецПроцедуры	

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьСуммарнуюДлительностьОтпусков();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьСуммарнуюДлительностьОтпусков();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	РассчитатьСуммарнуюДлительностьОтпусков()
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	// Открываем созданную форму, передавая в качестве владельца текущую форму 
	ДанныеДляГанта = ПолучитьДанныеТабличнойЧастиНаСервере(); 
	КлючУникальности = Объект.Ссылка;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеДляГанта", ДанныеДляГанта);
	ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект, КлючУникальности); 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеТабличнойЧастиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	
	КодВременногоХранилища = ПоместитьВоВременноеХранилище(Выборка, УникальныйИдентификатор);
	
	
	Возврат КодВременногоХранилища;
КонецФункции

&НаСервере
Процедура РассчитатьСуммарнуюДлительностьОтпусков()
	
	// Создаем соответствие, чтобы сгруппировать дни отпусков по каждому сотруднику
	МассивСотрудников = Новый Соответствие;
	СотрудникиСБольшимОтпуском = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Ключ,
	|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК Значение
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		МассивСотрудников.Вставить(ВыборкаДетальныеЗаписи.Ключ, ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла; 
	Для Каждого Элемент Из МассивСотрудников Цикл
		ТекущееЗначение = Элемент.Значение;
		Если ТекущееЗначение > 28 Тогда
			СотрудникиСБольшимОтпуском.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрТЧ Из Объект.ОтпускаСотрудников Цикл
		Если СотрудникиСБольшимОтпуском.Найти(СтрТЧ.Сотрудник) <> Неопределено Тогда
			СтрТЧ.ДлительностьОтпускаБольше28 = Истина;	
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти







