#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		СформироватьДвиженияДополнительныеНачисления();
		СформироватьУдержания();
		ВКМ_РассчитатьУдержанияНДФЛ.РассчитатьНачисления(Ссылка, Движения.ВКМ_Удержания);
		СформироватьДвиженияВзаиморасчетыССотрудниками();
		
	КонецПроцедуры 

	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	Процедура СформироватьДвиженияДополнительныеНачисления()
		
		// регистр ВКМ_ДополнительныеНачисления
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Подразделение = ТекСтрокаСписокСотрудников.Подразделение;
			Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
		КонецЦикла;
		
	КонецПроцедуры	
	
	Процедура СформироватьУдержания()
		
		// регистр ВКМ_Удержания
		
		Движения.ВКМ_Удержания.Записывать = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Показатель,
		|	КОНЕЦПЕРИОДА(ВКМ_ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК БазовыйПериодКонец,
		|	НАЧАЛОПЕРИОДА(ВКМ_ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК БазовыйПериодНачало
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	КОНЕЦПЕРИОДА(ВКМ_ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ),
		|	ВКМ_ДополнительныеНачисления.Подразделение,
		|	НАЧАЛОПЕРИОДА(ВКМ_ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = КонецМесяца(Дата);
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		Движения.ВКМ_Удержания.Записать();
		
	КонецПроцедуры	
	
	Процедура СформироватьДвиженияВзаиморасчетыССотрудниками()
		
		// ДВИЖЕНИЯ ПО РЕГИСТРУ ВЗАИМОРАСЧЕТЫ С СОТРУДНИКАМИ
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник,
		|	-ВКМ_Удержания.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_Начисления.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.Сотрудник";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
		
	КонецПроцедуры	
	
	#КонецОбласти
	
#КонецЕсли



