#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытийФормы
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
		
		Если Параметры.Свойство("Год") Тогда
			Объект.Год = Параметры.Год;
		КонецЕсли;
		
		// --- ВЕРХНЯЯ ШКАЛА ---
		ЭлементШкалыВерхний = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		ЭлементШкалыВерхний.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ЭлементШкалыВерхний.Формат = "ДФ = 'MMMM yyyy'"; 
		ЭлементШкалыВерхний.Кратность = 1;

		// --- НИЖНЯЯ ШКАЛА ---
		ЭлементШкалыНижний = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		ЭлементШкалыНижний.Единица = ТипЕдиницыШкалыВремени.День;
		ЭлементШкалыНижний.Формат = "ДФ = 'dd'"; 
		ЭлементШкалыНижний.Кратность = 1;
		ЭлементШкалыНижний.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;
		// Исходный период
		Период.ДатаНачала = НачалоГода(Объект.Год);
		Период.ДатаОкончания = КонецГода(Объект.Год);
		
		Если Параметры.Свойство("ДанныеДляГанта") Тогда
			ДанныеСОсновнойФормы = ПолучитьИзВременногоХранилища(Параметры.ДанныеДляГанта);
			ЗаполнитьДиаграммуГанта(Диаграмма, ДанныеСОсновнойФормы, Период);
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	&НаСервереБезКонтекста
	Процедура ЗаполнитьДиаграммуГанта(Диаграмма, ДанныеСОсновнойФормы, Период)
		
				// Заполнение диаграммы Ганта данными 
		Диаграмма.Обновление = Ложь;
		Диаграмма.Очистить();
		
        // Получение данных по отпускам	
		СерияОтпуск = Диаграмма.Серии.Добавить();
		СерияОтпуск.Текст = "Отпуск";
		
		СвязиТочек = Новый Соответствие;
		Для Каждого Запись Из ДанныеСОсновнойФормы Цикл 
			//Добавляем сотрудника как Точку 
			Сотрудник = Запись.Сотрудник;
			
			ТочкаСотрудник = СвязиТочек.Получить(Сотрудник);
			Если ТочкаСотрудник = Неопределено Тогда
				ТочкаСотрудник = Диаграмма.Точки.Добавить(); 
				ТочкаСотрудник.Текст = Сотрудник;
				СвязиТочек.Вставить(Сотрудник, ТочкаСотрудник);
			КонецЕсли;
			
			// Получение значения на пересечении Точек и Серий
			
			ЗначениеСотрудник = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
			
			
			// Создаем новый интервал
			Интервал = ЗначениеСотрудник.Добавить();
			Интервал.Начало = Запись.ДатаНачала;
			Интервал.Конец = Запись.ДатаОкончания;
			Интервал.Текст = "Отпуск"; 
			Интервал.Цвет = WebЦвета.Бирюзовый; 
		КонецЦикла;
		Диаграмма.Обновление = Истина;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли


