
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		ЧислоСекундВСутках = 86400;
		// регистр ВКМ_ОтпускаСотрудников Приход
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
			Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
			Движение.Год = Год;
			Движение.ДатаНачалаПлан = ТекСтрокаОтпускаСотрудников.ДатаНачала;
			Движение.ДатаОкончанияПлан = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
			Движение.КоличествоДней = (ТекСтрокаОтпускаСотрудников.ДатаОкончания - ТекСтрокаОтпускаСотрудников.ДатаНачала +ЧислоСекундВСутках)/ЧислоСекундВСутках;
		КонецЦикла;
		
	КонецПроцедуры
	#КонецОбласти
	
#КонецЕсли
