#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	// {{ Новикова А.В. вывод полей "Дата начала договора", "Дата окончания договора", "Абонентская плата",
	// "Стоимость часа работы специалиста" на форме, 
	//добавление поля для ввода % скидки и команды для пересчета сумм таблиц товаров и услуг 
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВКМ_РаботаСФормами.ДобавитьРеквизиты(ЭтаФорма);
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// {{ Новикова А.В. вывод полей "Дата начала договора", "Дата окончания договора", "Абонентская плата",
	// "Стоимость часа работы специалиста" на форме, 
	//добавление поля для ввода % скидки и команды для пересчета сумм таблиц товаров и услуг 
	ВидДоговораПриИзмененииНаСервере();
	// }} 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {{ Новикова А.В. вывод полей "Дата начала договора", "Дата окончания договора", "Абонентская плата",
	// "Стоимость часа работы специалиста" на форме, 
	//добавление поля для ввода % скидки и команды для пересчета сумм таблиц товаров и услуг 
	ВидДоговораПриИзмененииНаСервере();
	// }}
КонецПроцедуры

#КонецОбласти