#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда) 
	
	ДлительнаяОперация = СоздатьАктыНаСервере();  
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.Заголовок = "Операция выполняется";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция СоздатьАктыНаСервере() 
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	"ВКМ_МассовоеСозданиеРеализаций.ВыполнитьСозданиеРеализаций", Объект.Период);
	
	Возврат Результат; 
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если МассивДокументов = Неопределено Тогда
		ТекстСообщения = "Все реализации за указанный период уже созданы";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Объект.СозданныеДокументы.Очистить();
	
	Для Каждого Документ Из МассивДокументов Цикл
		НоваяСтрока = Объект.СозданныеДокументы.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.Ссылка = Документ.Ссылка;
		НоваяСтрока.Статус = Документ.Статус;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры 

#КонецОбласти



